// Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());
// int sqr = number* number;

// Console.WriteLine(sqr);

// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго

// Console.WriteLine("Введите первое число");
// int number1= Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число");
// int number2= Convert.ToInt32(Console.ReadLine());

// if(number1==number2)
// {
//     Console.WriteLine("Число 1 является квадратом");

// }
// else
// {
//     Console.WriteLine("Число 1 не является квадратом");
// }

// Напишите программу, которая будет выдавать название дня недели по заданному номеру

// Console.WriteLine("Введите число");
// int numberDay= Convert.ToInt32(Console.ReadLine());

// if(numberDay<1 || numberDay>7)
// {
//     Console.WriteLine("Ошибка");
// }

// if(numberDay==1)
// {
//     Console.WriteLine("Понедельник");
// }

// if(numberDay==2)
// {
//     Console.WriteLine("Вт");
// }
// if(numberDay==3)
// {
//     Console.WriteLine("Ср");
// }
// if(numberDay==4)
// {
//     Console.WriteLine("Чт");
// }
// if(numberDay==5)
// {
//     Console.WriteLine("Пят");
// }
// if(numberDay==6)
// {
//     Console.WriteLine("Субб");
// }
// if(numberDay==7)
// {
//     Console.WriteLine("Восс");
// }

// логическое сложение

// Console.WriteLine("Введите число");
// int number= Convert.ToInt32(Console.ReadLine());
// Console.Clear();
// int number2 = number*(-1);

// while(number2<=number)
// {
//     Console.WriteLine(number2);
//     number2++;
// }

